{
    "quotes": [
        "The whole secret lies in confusing the enemy, so that he cannot fathom our real intent. (Sun Tzu)",
        "...and the universe said I love you",
        "The most effective leaders strive to serve others over themselves",
        "When all Americans are treated as equal, no matter who they are or whom they love, we are all more free. (President Barack Obama)",
        "This world would be a whole lot better if we just made an effort to be less horrible to one another. (Elliot Page)",
        "There's nothing wrong with you. There's a lot wrong with the world you live in. (Chris Colfer)",
        "Dance like nobody's watching",
        "A brave man acknowledges the strength of others. (Veronica Roth)",
        "The biggest adventure you can ever take is to live the life of your dreams. (Oprah Winfrey)",
        "Be yourself; everyone else is already taken. (Oscar Wilde)",
        "Two things are infinite: the universe and human stupidity; and I'm not sure about the universe. (Albert Einstein)",
        "You only live once, but if you do it right, once is enough. (Mae West)",
        "There are no uninteresting things, only uninterested people. (G.K. Chesterton)",
        "For every minute you are angry you lose sixty seconds of happiness. (Ralph Waldo Emerson)",
        "Somewhere, something incredible is waiting to be known. (Carl Sagan)",
        "Do one thing every day that scares you. (Eleanor Roosevelt)",
        "We reveal most about ourselves when we speak about others. (Kamand Kojouri)"
    ],
    "projects": [
        {
            "name": "tams-club-calendar",
            "display": "TAMS Club Calendar",
            "color": "#00CE00",
            "href": "https://tams.club",
            "description": "The TAMS Club Calendar is a fully contained event tracker, club/volunteering database, and general resource center. This is the unofficial club event calendar for the Texas Academy of Mathematics and Science (TAMS) student organizations!"
        },
        {
            "name": "atab",
            "display": "aTab",
            "color": "#00CE9D",
            "href": "https://github.com/MichaelZhao21/atab",
            "description": "aTab is an extension that will replace your new tab into a more productive and useful interface! The interface features an aesthetic dark material theme, a news feed (from the News API), a list of customizable links on a sidebar, a place to jot down quick notes that can sync across devices, and a nice date/time display."
        },
        {
            "name": "discord-pr-notifs",
            "display": "Discord Pull Request Notifs",
            "color": "#006BCE",
            "href": "https://github.com/MichaelZhao21/pr-discord-notif",
            "description": "Listens to new pull requests from a Github repository and sends a message to a Discord text channel when a pull request is created. This is done through Github Webhooks, the Github API, and the Discordjs Bot Library."
        },
        {
            "name": "stickerinator",
            "display": "Stickerinator",
            "color": "#D06FFE",
            "href": "https://github.com/MichaelZhao21/stickerinator",
            "description": "Remove backgrounds and add a border to your images to turn them into stickers!"
        },
        {
            "name": "bf-interpreter",
            "display": "BrainF*ck Interpreter",
            "color": "#CEA100",
            "href": "https://github.com/MichaelZhao21/bf-interpreter",
            "description": "A crude but effective Brainfuck interpreter written in C"
        }
    ],
    "studying": [
        {
            "name": "fuzzing",
            "title": "Fuzzing",
            "body": "Exploring the automated testing of code through fuzzing research!"
        },
        {
            "name": "ml",
            "title": "Machine Learning",
            "body": "Hands-On Machine Learning with Scikit-Learn, Keras, and TensorFlow: Concepts, Tools, and Techniques to Build Intelligent Systems"
        },
        {
            "name": "rust",
            "title": "Rust",
            "body": "Learning and building a project with the modern Rust language"
        },
        {
            "name": "gavel",
            "title": "Gavel Hackathon Judging System",
            "body": "Exploring ways to rewrite Gavel, a hackathon judging system first created and used at HackMIT in 2015."
        }
    ]
}