{
    "quotes": [
        "The whole secret lies in confusing the enemy, so that he cannot fathom our real intent. (Sun Tzu)",
        "...and the universe said I love you",
        "The most effective leaders strive to serve others over themselves",
        "When all Americans are treated as equal, no matter who they are or whom they love, we are all more free. (President Barack Obama)",
        "This world would be a whole lot better if we just made an effort to be less horrible to one another. (Elliot Page)",
        "There's nothing wrong with you. There's a lot wrong with the world you live in. (Chris Colfer)",
        "Dance like nobody's watching",
        "A brave man acknowledges the strength of others. (Veronica Roth)",
        "The biggest adventure you can ever take is to live the life of your dreams. (Oprah Winfrey)",
        "Be yourself; everyone else is already taken. (Oscar Wilde)",
        "Two things are infinite: the universe and human stupidity; and I'm not sure about the universe. (Albert Einstein)",
        "You only live once, but if you do it right, once is enough. (Mae West)",
        "There are no uninteresting things, only uninterested people. (G.K. Chesterton)",
        "For every minute you are angry you lose sixty seconds of happiness. (Ralph Waldo Emerson)",
        "Somewhere, something incredible is waiting to be known. (Carl Sagan)",
        "Do one thing every day that scares you. (Eleanor Roosevelt)",
        "We reveal most about ourselves when we speak about others. (Kamand Kojouri)"
    ],
    "projects": [
        {
            "name": "jury",
            "display": "Jury",
            "color": "#00ACE6",
            "href": "https://github.com/MichaelZhao21/jury",
            "position": "Creator, Developer",
            "description": "A project designed to create a new pairwise judging system using modern technologies aimed at optimizing the user experience of judges and admin users. Using the same underlying statistical models and paper as Gavel, Jury is trying to deliver the best possible experience to everyone at the end of a grueling hackathon."
        },
        {
            "name": "tams-club-calendar",
            "display": "TAMS Club Calendar",
            "color": "#00CE00",
            "href": "https://tams.club",
            "position": "Creator, Developer, Designer",
            "description": "The TAMS Club Calendar is a fully contained event tracker, club/volunteering database, and general resource center. This is the unofficial club event calendar for the Texas Academy of Mathematics and Science (TAMS) student organizations!"
        },
        {
            "name": "hackportal",
            "display": "HackPortal",
            "color": "#7B81FF",
            "href": "https://hackportal.hackutd.co",
            "position": "Contributor",
            "description": "HackPortal is a platform for user-friendly hackathon event management. Developed by the HackUTD team with ACM Development, HackPortal features its own login system, QR code scanner, announcement notifications, and fully customizable event site."
        },
        {
            "name": "atab",
            "display": "aTab",
            "color": "#00CE9D",
            "href": "https://github.com/MichaelZhao21/atab",
            "position": "Creator, Developer",
            "description": "aTab is an extension that will replace your new tab into a more productive and useful interface! The interface features an aesthetic dark material theme, a news feed (from the News API), a list of customizable links on a sidebar, a place to jot down quick notes that can sync across devices, and a nice date/time display."
        },
        {
            "name": "discord-pr-notifs",
            "display": "Discord PR Notifs",
            "color": "#2795FB",
            "href": "https://github.com/MichaelZhao21/pr-discord-notif",
            "position": "Creator, Developer",
            "description": "Listens to new pull requests from a Github repository and sends a message to a Discord text channel when a pull request is created. This is done through Github Webhooks, the Github API, and the Discordjs Bot Library."
        },
        {
            "name": "stickerinator",
            "display": "Stickerinator",
            "color": "#D06FFE",
            "href": "https://github.com/MichaelZhao21/stickerinator",
            "position": "Creator, Developer",
            "description": "Remove backgrounds and add a border to your images to turn them into stickers!"
        },
        {
            "name": "bf-interpreter",
            "display": "BrainF*ck Interpreter",
            "color": "#CEA100",
            "href": "https://github.com/MichaelZhao21/bf-interpreter",
            "position": "Creator, Developer",
            "description": "A crude but effective Brainfuck interpreter written in C"
        }
    ],
    "about": [
        {
            "icon": "wand",
            "title": "Who Am I?",
            "body": "Hi! I'm Michael, an undergraduate student studying computer science at UTD. On my own time, I like to work on personal projects through code and art :DD"
        },
        {
            "icon": "cpu",
            "title": "Coding",
            "body": "Ever since I've started learning how to code, I've never stopped learning and building new things. I've worked with various languages, frameworks, and libraries across multiple disciplines of computer science. Currently, I'm exploring the intricacies behind Rust and its unique approach to language design. I've listed an assortment of my projects below, and you can find all of my projects on Github!"
        },
        {
            "icon": "dev",
            "title": "Hackathons",
            "body": "I have gone to most of the largest hackathons in Texas, and it's one of the most incredible experiences that any computer science student can have. A hackathon is a huge event where you and a team have 24 hours to build an innovative project and present it to judges. I've been to my fair share of hackathons (and won a couple), so I decided to settle down and help organize HackUTD. I currently serve as the director, and I hope to make this year's event the best we've ever had."
        },
        {
            "icon": "vial",
            "title": "Other Stuff!",
            "body": "Besides coding and attending hackathons, I also enjoy making art — traditional sketching will always be my favorite, but I have been doing a lot more digital art/design; reading books — science fiction is definitely top tier; DnD — I play as a cleric weekly in an awesome campaign with an even more awesome group of people; and working out!"
        }
    ],
    "links": [
        {
            "title": "Occam's Razor",
            "href": "https://conceptually.org/concepts/occams-razor"
        },
        {
            "title": "Library of Babel",
            "href": "https://libraryofbabel.info/"
        },
        {
            "title": "The Cube Rule",
            "href": "https://cuberule.com/"
        },
        {
            "title": "Principle of Least Astonishment",
            "href": "https://en.wikipedia.org/wiki/Principle_of_least_astonishment"
        },
        {
            "title": "User Inyerface",
            "href": "https://userinyerface.com/"
        },
        {
            "title": "Draw a Perfect Circle",
            "href": "https://vladgotlib.com/circular/"
        },
        {
            "title": "When2Meet",
            "href": "https://www.when2meet.com/"
        },
        {
            "title": "Candy Box 2",
            "href": "https://candybox2.github.io/"
        }
    ]
}
